app/controllers/admins/items_controller.rb

	def create
		item = Item.new(item_params)
		item.save
---
INSERT INTO "items" ("price", "count", "name", "artist_name", "label_name", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)