young_record/app/views/users/carts/buy.html.erb

SELECT "history_items".* FROM "history_items"
---
his_items
<% i = HistoryItem.all %>

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 1]]
---
cart_items
<% i = current_user.carts.all %>