app/views/users/carts/index.html.erb

SELECT COUNT(*) FROM "carts" WHERE "carts"."item_id" = ?  [["item_id", 1]]
---
			<td><%= items.name %></td>
			<td><%= items.carts.count %></td>