young_record/app/views/admins/items/new.html.erb

SELECT "genres".* FROM "genres"
---
<%= f.nested_fields_for :items_genres, wrapper_tag: :div do |q| %>
	<%= q.select :genre_id, Genre.all.map{|o| [o.name, o.id]} %>