young_record/app/controllers/users/carts_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "item_id", "count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["item_id", 1], ["count", 1], ["created_at", "2018-07-05 04:08:40.768136"], ["updated_at", "2018-07-05 04:08:40.768136"]]
---
	def create
		cart = Cart.new
		item = Item.find(params[:item_id])
		cart.user_id = current_user.id
		cart.item_id = item.id
		cart.count = params[:count][:count]
		cart.save