app/views/items/show.html.erb

SELECT "items_genres".* FROM "items_genres" WHERE "items_genres"."item_id" = ?  [["item_id", 1]]
---
                <td>genre</td>
                <td><% @item.items_genres.each do |f| %>